{
  "blogs": [
    {
      "id":"blog1",
      "title":"XHR",
      "date":"04/3/18",
      "post":"Last week we were going through XHR request and Callback Functions. XHR is a way to get data back from a server, but under the hood to get data back usually take some time. In this case we need to use Callback Functions that allow us to run code synchronously. I use XHR Request in my project “Solar System”. I stored data for the app in JSON file. Why JSON? Because when exchanging data between a browser and a server, the data can only be text. JSON is text, and we can convert any JavaScript object into JSON, and send JSON to the server.We can also convert any JSON received from the server into JavaScript objects.This way we can work with the data as JavaScript objects, with no complicated parsing and translations."
    },

    {
      "id": "blog2",
      "title": "Travel Diary",
      "date": "03/27/18",
      "post":
        "Last week I started new project Travel Diary with my awesome team Venus Flytrap. The main goal was to create array of objects then print each object to the DOM. Also, each object supposed to have an input section that would aloud user to add notes. Moreover, every time user add note it would appear at the bottom of the page as a new separate box which would include note itself and country location. During this project I was struggling with pulling specific data from input and printing it to the notes section. I spend whole day trying to figure out how to deal with it. Finally I decided to take a break...Magic happen during my break. I suddenly realize that I can use data attributes that would aloud me to store and reuse specific information. Lesson learned: if you stuck on coding then it’s time to take a break."
    },

    {
      "id": "blog3",
      "title": "Blog Section",
      "date": "03/19/2018",
      "post":
        "Finally finished with my blog section. Still need to do a lot of work, but my function 'writeToDom' is working. Also, I add some styling to it which made my 'grid' look better."
    },

    {
      "id": "blog4",
      "title": "Personal Bio Site",
      "date": "03/13/2018",
      "post":
        "Working on my personal page. Decided to build a new portfolio bc old one was not responsive in a browser. According to portfolio requirements it supposed to be build with HTML5 and CSS. Sounds easy but since I taught myself to work with the bootstrap it took me some time to refresh my knowledge with flex box. It was a good practice for me to go over basic material"
    }
  ]
}
